# Example 2

LIMIT and add a WHERE Clause

## Import libraries

In [1]:
import sqlite3
import pandas as pd

## Create a connection object

In [2]:
con = sqlite3.connect('../Database.db')
cur = con.cursor()

## SQL statement

In [3]:
# The following SQL statement selects the first three records from the "Customers" table, where the country is "Germany".
query = '''
            SELECT * 
            FROM Customers
            WHERE Country = 'Germany'
            LIMIT 3
        '''

## Show table

In [4]:
df = pd.read_sql_query(query, con)
df

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,6,Blauer See Delikatessen,Hanna Moos,Forsterstr. 57,Mannheim,68306,Germany
2,17,Drachenblut Delikatessend,Sven Ottlieb,Walserweg 21,Aachen,52066,Germany

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    3 non-null      int64
 1   CustomerName  3 non-null      object
 2   ContactName   3 non-null      object
 3   Address       3 non-null      object
 4   City          3 non-null      object
 5   PostalCode    3 non-null      object
 6   Country       3 non-null      object
dtypes: int64(1), object(6)
memory usage: 300.0+ bytes

## Close the connection

In [6]:
con.close()